**1.2. Загрузка данных из csv**

In [100]:

# прочитаем датафрейм и посмотрим на него:
import os
import pandas as pd

df = pd.read_csv(os.path.join("./supermarket_sales.csv"))
df

,Invoice_ID,Branch,City,Customer_type,Gender,Product_line,Unit_price,Quantity,Total,Date,Time,Payment,Payments_fee,Gross_income,Cost_price,Unit_cost
0,765-26-6951,A,Yangon,Normal,Male,Sports and travel,76.24,6,457.44,01/01/19,10:39,Credit card,13.72,68.62,388.82,64.8
1,530-90-9855,A,Yangon,Member,Male,Home and lifestyle,49.97,8,399.76,01/01/19,14:47,Cash,0.00,71.96,327.80,40.98
2,891-01-7034,B,Mandalay,Normal,Male,Electronic accessories,78.45,6,470.67,01/01/19,19:07,Cash,0.00,70.60,400.07,66.68
3,493-65-6248,C,Naypyitaw,Member,Female,Sports and travel,38.83,10,388.29,01/01/19,19:48,Credit card,11.65,58.24,330.05,33.01
4,556-97-7101,C,Naypyitaw,Normal,Female,Electronic accessories,66.38,2,132.76,01/01/19,15:51,Cash,0.00,19.91,112.85,56.43
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1171,291-55-6563,A,Yangon,Member,Female,Home and lifestyle,36.14,6,216.85,03/30/19,12:45,Ewallet,3.25,39.03,177.82,29.64
1172,361-85-2571,A,Yangon,Normal,Female,Sports and travel,93.95,5,469.77,03/30/19,10:18,Cash,0.00,70.47,399.30,79.86
1173,364-34-2972,C,Naypyitaw,Member,Male,Electronic accessories,101.66,3,304.98,03/30/19,20:37,Cash,0.00,45.75,259.23,86.41
1174,115-38-7382,C,Naypyitaw,Member,Female,Fashion accessories,4.64,8,37.12,03/30/19,12:51,Credit card,1.11,9.28,27.84,3.48
1175,115-38-7382,C,Naypyitaw,Member,Female,Fashion accessories,4.97,8,39.75,03/30/19,12:51,Credit card,1.19,9.94,29.81,3.73

**1.3 Проверка и анализ типа входящих данных**

In [101]:
# выведем типы данных:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1176 entries, 0 to 1175
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Invoice_ID     1176 non-null   object
 1   Branch         1175 non-null   object
 2   City           1175 non-null   object
 3   Customer_type  1176 non-null   object
 4   Gender         1175 non-null   object
 5   Product_line   1175 non-null   object
 6   Unit_price     1175 non-null   float64
 7   Quantity       1176 non-null   int64
 8   Total          1176 non-null   float64
 9   Date           1175 non-null   object
 10  Time           1175 non-null   object
 11  Payment        1175 non-null   object
 12  Payments_fee   1176 non-null   float64
 13  Gross_income   1175 non-null   float64
 14  Cost_price     1176 non-null   float64
 15  Unit_cost      1175 non-null   object
dtypes: float64(5), int64(1), object(10)
memory usage: 147.1+ KB

https://pandas.pydata.org/docs/user_guide/basics.html#basics-dtypes


Типы данных для числовых полей:
* Unit_price  float64
* Quantity   int64  
* Total   float64
* Payments_fee   float64
* Gross_income   float64
* Cost_price   float64

автоматически назначены правильно. Не требуют коррекции

Для полей в которых содержатся категориальные признаки:

* Branch  object
* City  object
* Customer_type object
* Gender  object
* Product_line  object
* Payments object

лучше подходит тип **Categorical**


Для полей с датой и временем:

* Date  object
* Time  object

должен быть тип **datetime**

In [102]:
# проведем замену типа данных object на  Categorical (https://pandas.pydata.org/docs/user_guide/categorical.html):
df["Branch"] = df["Branch"].astype("category")
df["City"] = df["City"].astype("category")
df["Gender"] = df["Gender"].astype("category")
df["Product_line"] = df["Product_line"].astype("category")
df["Payment"] = df["Payment"].astype("category")

# проведем замену типа object на datetime
df['Date'] = df['Date'].astype('datetime64[ns]')
df['Time'] = df['Time'].astype('datetime64[ns]')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1176 entries, 0 to 1175
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Invoice_ID     1176 non-null   object
 1   Branch         1175 non-null   category
 2   City           1175 non-null   category
 3   Customer_type  1176 non-null   object
 4   Gender         1175 non-null   category
 5   Product_line   1175 non-null   category
 6   Unit_price     1175 non-null   float64
 7   Quantity       1176 non-null   int64
 8   Total          1176 non-null   float64
 9   Date           1175 non-null   datetime64[ns]
 10  Time           1175 non-null   datetime64[ns]
 11  Payment        1175 non-null   category
 12  Payments_fee   1176 non-null   float64
 13  Gross_income   1175 non-null   float64
 14  Cost_price     1176 non-null   float64
 15  Unit_cost      1175 non-null   object
dtypes: category(5), datetime64[ns](2), float64(5), int64(1), object(3)
memory usage: 107.8+ KB

/tmp/ipykernel_8568/3968984724.py:9: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['Date'] = df['Date'].astype('datetime64[ns]')
/tmp/ipykernel_8568/3968984724.py:10: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['Time'] = df['Time'].astype('datetime64[ns]')

In [103]:
# замену типов можно сделать более элегантно:
for col in ["Branch", "City", "Gender", "Product_line", "Payment"]:
  df[col] = df[col].astype("category")

for col in ['Date', 'Time']:
  df[col] = df[col].astype('datetime64[ns]')

# или даже так:
fields_types = [("Branch", "category"), ("City", "category"), ("Gender", "category"),
 ("Product_line", "category"), ("Payment", "category"), ('Date', 'datetime64[ns]'),
  ('Time', 'datetime64[ns]'), ("Customer_type", "category")]

for col, tp in fields_types:
  df[col] = df[col].astype(tp)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1176 entries, 0 to 1175
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Invoice_ID     1176 non-null   object
 1   Branch         1175 non-null   category
 2   City           1175 non-null   category
 3   Customer_type  1176 non-null   category
 4   Gender         1175 non-null   category
 5   Product_line   1175 non-null   category
 6   Unit_price     1175 non-null   float64
 7   Quantity       1176 non-null   int64
 8   Total          1176 non-null   float64
 9   Date           1175 non-null   datetime64[ns]
 10  Time           1175 non-null   datetime64[ns]
 11  Payment        1175 non-null   category
 12  Payments_fee   1176 non-null   float64
 13  Gross_income   1175 non-null   float64
 14  Cost_price     1176 non-null   float64
 15  Unit_cost      1175 non-null   object
dtypes: category(6), datetime64[ns](2), float64(5), int64(1), object(2)
memory usage: 99.9+ KB

In [104]:
# попробуем заменить поле Unit_cost на тип float64
# у нас возникает проблема, т. к. одно из значений этого поля #DIV/0!
# сначала заменим это значение на 0:
df["Unit_cost"][df["Unit_cost"] == "#DIV/0!"] = 0.0
# после этого поменяем тип поля
df["Unit_cost"] = df["Unit_cost"].astype("float64")

/tmp/ipykernel_8568/1552714253.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Unit_cost"][df["Unit_cost"] == "#DIV/0!"] = 0.0

**1.4 Проверка наличие дубликатов в данных**

In [105]:
# проверим на наличие дубликатов: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.duplicated.html
# как находить дубликаты, можно посмотреть по ссылке: https://www.statology.org/pandas-find-duplicates/
duplicateRows = df[df.duplicated(keep='last')]
duplicateRows

,Invoice_ID,Branch,City,Customer_type,Gender,Product_line,Unit_price,Quantity,Total,Date,Time,Payment,Payments_fee,Gross_income,Cost_price,Unit_cost
33,656-16-1063,B,Mandalay,Normal,Male,Sports and travel,48.74,3,146.22,2019-01-04,2023-11-05 13:24:00,Credit card,4.39,21.93,124.29,41.43
80,750-57-9686,C,Naypyitaw,Normal,Female,Home and lifestyle,47.65,4,190.60,2019-01-08,2023-11-05 13:48:00,Credit card,5.72,34.31,156.29,39.07
131,659-36-1684,C,Naypyitaw,Member,Male,Sports and travel,59.98,7,419.83,2019-01-12,2023-11-05 12:02:00,Credit card,12.59,62.97,356.86,50.98
161,785-13-7708,B,Mandalay,Normal,Male,Food and beverages,76.71,7,536.99,2019-01-14,2023-11-05 19:06:00,Credit card,16.11,64.44,472.55,67.51
201,286-62-6249,B,Mandalay,Normal,Male,Clothes and accessories,25.01,5,125.06,2019-01-16,2023-11-05 20:12:00,Credit card,2.48,8.75,116.31,23.26

Таким образом мы нашли 5 строк у которых есть дубли, теперь давайте их удалим:

In [106]:
df.drop_duplicates(inplace=True) # удаление дубликатов из датафрейма

**2.1 Исследование категориальных типов данных**

После того, как мы заменили тип данных на category, для того, чтобы узнать, какие значения принимают категориальные признаки, достаточно вывести соответствующее поле датафрейма, тогда под датафреймом выводится список категорий

In [107]:
print(df["Branch"])
print(df["City"])
print(df["Gender"])
print(df["Product_line"])
print(df["Payment"])

# или более элегантно:
for cl in ["Branch", "City", "Gender", "Product_line", "Payment"]:
  print(cl)

0       A
1       A
2       B
3       C
4       C
       ..
1171    A
1172    A
1173    C
1174    C
1175    C
Name: Branch, Length: 1171, dtype: category
Categories (3, object): ['A', 'B', 'C']
0          Yangon
1          Yangon
2        Mandalay
3       Naypyitaw
4       Naypyitaw
          ...
1171       Yangon
1172       Yangon
1173    Naypyitaw
1174    Naypyitaw
1175    Naypyitaw
Name: City, Length: 1171, dtype: category
Categories (3, object): ['Mandalay', 'Naypyitaw', 'Yangon']
0         Male
1         Male
2         Male
3       Female
4       Female
         ...
1171    Female
1172    Female
1173      Male
1174    Female
1175    Female
Name: Gender, Length: 1171, dtype: category
Categories (2, object): ['Female', 'Male']
0            Sports and travel
1           Home and lifestyle
2       Electronic accessories
3            Sports and travel
4       Electronic accessories
                 ...
1171        Home and lifestyle
1172         Sports and travel
1173    Electronic accessories
1174       Fashion accessories
1175       Fashion accessories
Name: Product_line, Length: 1171, dtype: category
Categories (7, object): ['Clothes and accessories', 'Electronic accessories', 'Fashion accessories', 'Food and beverages', 'Health and beauty', 'Home and lifestyle', 'Sports and travel']
0       Credit card
1              Cash
2              Cash
3       Credit card
4              Cash
           ...
1171        Ewallet
1172           Cash
1173           Cash
1174    Credit card
1175    Credit card
Name: Payment, Length: 1171, dtype: category
Categories (3, object): ['Cash', 'Credit card', 'Ewallet']
Branch
City
Gender
Product_line
Payment

другой вариант получить уникальные значения, использовать соответствующий метод pandas

In [108]:
for cl in ["Branch", "City", "Gender", "Product_line", "Payment"]:
  print(df[cl].unique())

['A', 'B', 'C', NaN]
Categories (3, object): ['A', 'B', 'C']
['Yangon', 'Mandalay', 'Naypyitaw', NaN]
Categories (3, object): ['Mandalay', 'Naypyitaw', 'Yangon']
['Male', 'Female', NaN]
Categories (2, object): ['Female', 'Male']
['Sports and travel', 'Home and lifestyle', 'Electronic accessories', 'Health and beauty', 'Fashion accessories', 'Food and beverages', 'Clothes and accessories', NaN]
Categories (7, object): ['Clothes and accessories', 'Electronic accessories', 'Fashion accessories', 'Food and beverages', 'Health and beauty', 'Home and lifestyle', 'Sports and travel']
['Credit card', 'Cash', 'Ewallet', NaN]
Categories (3, object): ['Cash', 'Credit card', 'Ewallet']

**2.2 Статистический анализ датасета, поиск аномалий**

In [109]:
df.describe()

,Unit_price,Quantity,Total,Date,Time,Payments_fee,Gross_income,Cost_price,Unit_cost
count,1170.000000,1171.000000,1171.000000,1170,1170,1171.000000,1170.000000,1171.000000,1170.000000
mean,54.589624,5.518360,1146.387515,2019-02-13 22:26:27.692307456,2023-11-05 15:26:39.948718080,4.377506,50.361709,1096.068813,45.298120
min,-80.000000,0.000000,-1200.000000,2019-01-01 00:00:00,2023-11-05 10:00:00,0.000000,-216.000000,-984.000000,-65.600000
25%,27.510000,3.000000,100.840000,2019-01-24 00:00:00,2023-11-05 12:46:00,0.000000,13.880000,84.630000,23.252500
50%,53.720000,5.000000,214.140000,2019-02-13 00:00:00,2023-11-05 15:23:00,2.230000,35.780000,177.820000,43.555000
75%,79.355000,8.000000,432.110000,2019-03-08 00:00:00,2023-11-05 18:17:00,6.180000,73.395000,358.090000,66.180000
max,271.490000,15.000000,1000000.000000,2019-03-30 00:00:00,2023-11-05 21:02:00,31.280000,260.660000,1000000.000000,252.490000
std,31.367511,2.957008,29215.251818,NaN,NaN,5.870741,47.182333,29216.395509,26.437064

**2.3 Поиск и удаление аномалий**

Подозрительными являются отрицательные значения для цены единицы товара и выручки.
Посмотрим, что это за записи

In [110]:
# минимум для цены
df[df["Unit_price"] == df["Unit_price"].min()]

,Invoice_ID,Branch,City,Customer_type,Gender,Product_line,Unit_price,Quantity,Total,Date,Time,Payment,Payments_fee,Gross_income,Cost_price,Unit_cost
157,195-06-0437,A,Yangon,Member,Male,Home and lifestyle,-80.0,15,-1200.0,2019-01-13,2023-11-05 13:00:00,Credit card,0.0,-216.0,-984.0,-65.6

In [111]:
# минимум для выручки
df[df["Total"] == df["Total"].min()]

,Invoice_ID,Branch,City,Customer_type,Gender,Product_line,Unit_price,Quantity,Total,Date,Time,Payment,Payments_fee,Gross_income,Cost_price,Unit_cost
157,195-06-0437,A,Yangon,Member,Male,Home and lifestyle,-80.0,15,-1200.0,2019-01-13,2023-11-05 13:00:00,Credit card,0.0,-216.0,-984.0,-65.6

Видим, что отрицательное значение цены и выручки в одной и той же строке, очевидно, что цена товара и выручка от продажи не могут быть отрицательными (кроме случаев, когда было произведено исправление ошибочной записи, некоторые учетные программы не позволяют удалять исторические значения и для удаления или корректировки, приходится вносить запись с отрицательными цифрами, но мы тут такое не рассматриваем)

In [112]:
# максимум для выручки
df[df["Total"] == df["Total"].max()]

,Invoice_ID,Branch,City,Customer_type,Gender,Product_line,Unit_price,Quantity,Total,Date,Time,Payment,Payments_fee,Gross_income,Cost_price,Unit_cost
82,750-57-9690,C,Naypyitaw,Normal,Female,Home and lifestyle,0.0,0,1000000.0,2019-01-08,2023-11-05 13:48:00,Credit card,0.0,0.0,1000000.0,NaN

In [113]:
# посмотрим всю выручку без учета 82 строки (82 индекса)
df["Total"].drop(index=82, axis=0).sum()

342419.78

сумма по всем продажам за 3 месяца по всем дивизионам почти в 3 раза меньше, чем одна продажа, скорее всего в данных ошибка (отсутствие количества проданных товаров, также подтверждает нашу догадку). Удалим ошибочные значения из нашего датасета.

In [114]:
df.drop(index=[82, 157], axis=0, inplace=True)
df.describe()

,Unit_price,Quantity,Total,Date,Time,Payments_fee,Gross_income,Cost_price,Unit_cost
count,1168.000000,1169.000000,1169.000000,1168,1168,1169.000000,1168.000000,1169.000000,1169.000000
mean,54.751592,5.514970,293.943353,2019-02-13 23:51:22.191780864,2023-11-05 15:26:52.551369728,4.384996,50.632877,243.353790,45.392985
min,0.500000,0.000000,3.740000,2019-01-01 00:00:00,2023-11-05 10:00:00,0.000000,0.260000,3.480000,0.000000
25%,27.562500,3.000000,100.920000,2019-01-24 00:00:00,2023-11-05 12:46:00,0.000000,13.925000,84.650000,23.260000
50%,53.795000,5.000000,214.140000,2019-02-13 00:00:00,2023-11-05 15:23:00,2.240000,35.920000,177.820000,43.560000
75%,79.387500,8.000000,431.450000,2019-03-08 00:00:00,2023-11-05 18:17:15,6.190000,73.450000,356.860000,66.230000
max,271.490000,12.000000,1042.650000,2019-03-30 00:00:00,2023-11-05 21:02:00,31.280000,260.660000,910.320000,252.490000
std,31.104743,2.942076,240.730397,NaN,NaN,5.872967,46.550458,198.430836,26.248396

Теперь все числовые значения кажутся разумными

**2.4 Поиск и заполнение пропусков в данных**

In [115]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1169 entries, 0 to 1175
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Invoice_ID     1169 non-null   object
 1   Branch         1168 non-null   category
 2   City           1168 non-null   category
 3   Customer_type  1169 non-null   category
 4   Gender         1168 non-null   category
 5   Product_line   1168 non-null   category
 6   Unit_price     1168 non-null   float64
 7   Quantity       1169 non-null   int64
 8   Total          1169 non-null   float64
 9   Date           1168 non-null   datetime64[ns]
 10  Time           1168 non-null   datetime64[ns]
 11  Payment        1168 non-null   category
 12  Payments_fee   1169 non-null   float64
 13  Gross_income   1168 non-null   float64
 14  Cost_price     1169 non-null   float64
 15  Unit_cost      1169 non-null   float64
dtypes: category(6), datetime64[ns](2), float64(6), int64(1), object(1)
memory usage: 108.3+ KB

In [116]:
# выведем строки с пропусками в данных:
columns = ['Branch', 'City', 'Customer_type', 'Gender', 'Product_line',
                    'Unit_price', 'Quantity', 'Total', 'Date', 'Time',
                    'Payment', 'Payments_fee', 'Gross_income', 'Unit_cost']
for col in columns:
  print(df[df[col].isnull()])

      Invoice_ID Branch City Customer_type Gender Product_line  Unit_price  \
273  604-70-6480    NaN  NaN        Member    NaN          NaN         NaN

     Quantity  Total Date Time Payment  Payments_fee  Gross_income  \
273         0    5.0  NaT  NaT     NaN           1.0           NaN

     Cost_price  Unit_cost
273         5.0        0.0
      Invoice_ID Branch City Customer_type Gender Product_line  Unit_price  \
273  604-70-6480    NaN  NaN        Member    NaN          NaN         NaN

     Quantity  Total Date Time Payment  Payments_fee  Gross_income  \
273         0    5.0  NaT  NaT     NaN           1.0           NaN

     Cost_price  Unit_cost
273         5.0        0.0
Empty DataFrame
Columns: [Invoice_ID, Branch, City, Customer_type, Gender, Product_line, Unit_price, Quantity, Total, Date, Time, Payment, Payments_fee, Gross_income, Cost_price, Unit_cost]
Index: []
      Invoice_ID Branch City Customer_type Gender Product_line  Unit_price  \
273  604-70-6480    NaN  NaN        Member    NaN          NaN         NaN

     Quantity  Total Date Time Payment  Payments_fee  Gross_income  \
273         0    5.0  NaT  NaT     NaN           1.0           NaN

     Cost_price  Unit_cost
273         5.0        0.0
      Invoice_ID Branch City Customer_type Gender Product_line  Unit_price  \
273  604-70-6480    NaN  NaN        Member    NaN          NaN         NaN

     Quantity  Total Date Time Payment  Payments_fee  Gross_income  \
273         0    5.0  NaT  NaT     NaN           1.0           NaN

     Cost_price  Unit_cost
273         5.0        0.0
      Invoice_ID Branch City Customer_type Gender Product_line  Unit_price  \
273  604-70-6480    NaN  NaN        Member    NaN          NaN         NaN

     Quantity  Total Date Time Payment  Payments_fee  Gross_income  \
273         0    5.0  NaT  NaT     NaN           1.0           NaN

     Cost_price  Unit_cost
273         5.0        0.0
Empty DataFrame
Columns: [Invoice_ID, Branch, City, Customer_type, Gender, Product_line, Unit_price, Quantity, Total, Date, Time, Payment, Payments_fee, Gross_income, Cost_price, Unit_cost]
Index: []
Empty DataFrame
Columns: [Invoice_ID, Branch, City, Customer_type, Gender, Product_line, Unit_price, Quantity, Total, Date, Time, Payment, Payments_fee, Gross_income, Cost_price, Unit_cost]
Index: []
      Invoice_ID Branch City Customer_type Gender Product_line  Unit_price  \
273  604-70-6480    NaN  NaN        Member    NaN          NaN         NaN

     Quantity  Total Date Time Payment  Payments_fee  Gross_income  \
273         0    5.0  NaT  NaT     NaN           1.0           NaN

     Cost_price  Unit_cost
273         5.0        0.0
      Invoice_ID Branch City Customer_type Gender Product_line  Unit_price  \
273  604-70-6480    NaN  NaN        Member    NaN          NaN         NaN

     Quantity  Total Date Time Payment  Payments_fee  Gross_income  \
273         0    5.0  NaT  NaT     NaN           1.0           NaN

     Cost_price  Unit_cost
273         5.0        0.0
      Invoice_ID Branch City Customer_type Gender Product_line  Unit_price  \
273  604-70-6480    NaN  NaN        Member    NaN          NaN         NaN

     Quantity  Total Date Time Payment  Payments_fee  Gross_income  \
273         0    5.0  NaT  NaT     NaN           1.0           NaN

     Cost_price  Unit_cost
273         5.0        0.0
Empty DataFrame
Columns: [Invoice_ID, Branch, City, Customer_type, Gender, Product_line, Unit_price, Quantity, Total, Date, Time, Payment, Payments_fee, Gross_income, Cost_price, Unit_cost]
Index: []
      Invoice_ID Branch City Customer_type Gender Product_line  Unit_price  \
273  604-70-6480    NaN  NaN        Member    NaN          NaN         NaN

     Quantity  Total Date Time Payment  Payments_fee  Gross_income  \
273         0    5.0  NaT  NaT     NaN           1.0           NaN

     Cost_price  Unit_cost
273         5.0        0.0
Empty DataFrame
Columns: [Invoice_ID, Branch, City, Customer_type, Gender, Product_line, Unit_price, Quantity, Total, Date, Time, Payment, Payments_fee, Gross_income, Cost_price, Unit_cost]
Index: []

В датасете есть только одна строка с пропущенными данными (не считая полей с неправдоподбными значениями).
Проще и, возможно, правильнее было бы ее удалить. Удаление данной строки не является неправильным решением со стороны аналитика.

Но т. к. стоит задача, заполнить наиболее частотными значениями для категориальных признаков и средними для числовых, то сделаем это. Остался вопрос со столбцом даты и времени.

In [117]:
# категориальные признаки:
category_columns = ['Branch', 'City', 'Customer_type', 'Gender', 'Product_line', 'Payment']

# выведем для каждого категориального признака количество значений:
for col in category_columns:
  print(df[[col]].value_counts())

Branch
B         393
C         389
A         386
Name: count, dtype: int64
City
Mandalay     393
Naypyitaw    389
Yangon       386
Name: count, dtype: int64
Customer_type
Normal           586
Member           583
Name: count, dtype: int64
Gender
Female    635
Male      533
Name: count, dtype: int64
Product_line
Fashion accessories        198
Food and beverages         174
Electronic accessories     170
Sports and travel          166
Home and lifestyle         160
Health and beauty          152
Clothes and accessories    148
Name: count, dtype: int64
Payment
Ewallet        406
Cash           392
Credit card    370
Name: count, dtype: int64

In [118]:
# выведем самые частотные значения для каждого категориального признака:
for col in category_columns:
  print(col, ": ", df[col].value_counts().idxmax())

Branch :  B
City :  Mandalay
Customer_type :  Normal
Gender :  Female
Product_line :  Fashion accessories
Payment :  Ewallet

In [119]:
# заполним пропуски в категориальных признаках самым частотным значением:
print(df[df[col].isnull()])

for col in category_columns:
  df[col][df[col].isnull()] = df[col].value_counts().idxmax()

      Invoice_ID Branch City Customer_type Gender Product_line  Unit_price  \
273  604-70-6480    NaN  NaN        Member    NaN          NaN         NaN

     Quantity  Total Date Time Payment  Payments_fee  Gross_income  \
273         0    5.0  NaT  NaT     NaN           1.0           NaN

     Cost_price  Unit_cost
273         5.0        0.0

In [122]:
df[266:267]

,Invoice_ID,Branch,City,Customer_type,Gender,Product_line,Unit_price,Quantity,Total,Date,Time,Payment,Payments_fee,Gross_income,Cost_price,Unit_cost
273,604-70-6480,B,Mandalay,Member,Female,Fashion accessories,NaN,0,5.0,NaT,NaT,Ewallet,1.0,NaN,5.0,0.0

Перейдем к числовым признакам

In [121]:
# числовые столбцы, добавим туда же тип даты-времени:
float_columns = ["Unit_price", "Quantity", "Total", "Date", "Time", "Payments_fee", 
                     "Cost_price", "Gross_income", "Unit_cost"]
# посмотрим на средние значения по каждому числовому столбцу:
for col in float_columns:
  print(col, ": ", df[col].mean())

Unit_price :  54.751592465753426
Quantity :  5.514970059880239
Total :  293.9433532934132
Date :  2019-02-13 23:51:22.191780864
Time :  2023-11-05 15:26:52.551369728
Payments_fee :  4.384995722840034
Cost_price :  243.3537895637297
Gross_income :  50.632876712328766
Unit_cost :  45.39298545765612

In [123]:
# заменим пропущенные числовые признаки на средние:
# отдельно для поля int:
print(int(df["Quantity"].mean()))
df["Quantity"][df["Quantity"] == 0] = int(df["Quantity"].mean())

for col in numerical_columns:
    df[col][df[col].isnull()] = df[col].mean()

5

/tmp/ipykernel_8568/351118737.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Quantity"][df["Quantity"] == 0] = int(df["Quantity"].mean())
/tmp/ipykernel_8568/351118737.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[col][df[col].isnull()] = df[col].mean()

In [125]:
df[266:267]

,Invoice_ID,Branch,City,Customer_type,Gender,Product_line,Unit_price,Quantity,Total,Date,Time,Payment,Payments_fee,Gross_income,Cost_price,Unit_cost
273,604-70-6480,B,Mandalay,Member,Female,Fashion accessories,54.751592,5,5.0,2019-02-13 23:51:22.191780864,2023-11-05 15:26:52.551369728,Ewallet,1.0,50.632877,5.0,0.0

In [126]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1169 entries, 0 to 1175
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Invoice_ID     1169 non-null   object
 1   Branch         1169 non-null   category
 2   City           1169 non-null   category
 3   Customer_type  1169 non-null   category
 4   Gender         1169 non-null   category
 5   Product_line   1169 non-null   category
 6   Unit_price     1169 non-null   float64
 7   Quantity       1169 non-null   int64
 8   Total          1169 non-null   float64
 9   Date           1169 non-null   datetime64[ns]
 10  Time           1169 non-null   datetime64[ns]
 11  Payment        1169 non-null   category
 12  Payments_fee   1169 non-null   float64
 13  Gross_income   1169 non-null   float64
 14  Cost_price     1169 non-null   float64
 15  Unit_cost      1169 non-null   float64
dtypes: category(6), datetime64[ns](2), float64(6), int64(1), object(1)
memory usage: 108.3+ KB

In [128]:
df.to_csv("clear_data.csv")

In [131]:
df = pd.read_csv("clear_data.csv")
df

,Unnamed: 0,Invoice_ID,Branch,City,Customer_type,Gender,Product_line,Unit_price,Quantity,Total,Date,Time,Payment,Payments_fee,Gross_income,Cost_price,Unit_cost
0,0,765-26-6951,A,Yangon,Normal,Male,Sports and travel,76.24,6,457.44,2019-01-01 00:00:00.000000000,2023-11-05 10:39:00.000000000,Credit card,13.72,68.62,388.82,64.80
1,1,530-90-9855,A,Yangon,Member,Male,Home and lifestyle,49.97,8,399.76,2019-01-01 00:00:00.000000000,2023-11-05 14:47:00.000000000,Cash,0.00,71.96,327.80,40.98
2,2,891-01-7034,B,Mandalay,Normal,Male,Electronic accessories,78.45,6,470.67,2019-01-01 00:00:00.000000000,2023-11-05 19:07:00.000000000,Cash,0.00,70.60,400.07,66.68
3,3,493-65-6248,C,Naypyitaw,Member,Female,Sports and travel,38.83,10,388.29,2019-01-01 00:00:00.000000000,2023-11-05 19:48:00.000000000,Credit card,11.65,58.24,330.05,33.01
4,4,556-97-7101,C,Naypyitaw,Normal,Female,Electronic accessories,66.38,2,132.76,2019-01-01 00:00:00.000000000,2023-11-05 15:51:00.000000000,Cash,0.00,19.91,112.85,56.43
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1164,1171,291-55-6563,A,Yangon,Member,Female,Home and lifestyle,36.14,6,216.85,2019-03-30 00:00:00.000000000,2023-11-05 12:45:00.000000000,Ewallet,3.25,39.03,177.82,29.64
1165,1172,361-85-2571,A,Yangon,Normal,Female,Sports and travel,93.95,5,469.77,2019-03-30 00:00:00.000000000,2023-11-05 10:18:00.000000000,Cash,0.00,70.47,399.30,79.86
1166,1173,364-34-2972,C,Naypyitaw,Member,Male,Electronic accessories,101.66,3,304.98,2019-03-30 00:00:00.000000000,2023-11-05 20:37:00.000000000,Cash,0.00,45.75,259.23,86.41
1167,1174,115-38-7382,C,Naypyitaw,Member,Female,Fashion accessories,4.64,8,37.12,2019-03-30 00:00:00.000000000,2023-11-05 12:51:00.000000000,Credit card,1.11,9.28,27.84,3.48
1168,1175,115-38-7382,C,Naypyitaw,Member,Female,Fashion accessories,4.97,8,39.75,2019-03-30 00:00:00.000000000,2023-11-05 12:51:00.000000000,Credit card,1.19,9.94,29.81,3.73

**3 Бизнес-анализ данных с помощью библиотеки pandas**

3.1 Сравнение выручки и прибыли по дивизионам

In [134]:
df[["Branch", "Total", "Gross_income"]].groupby("Branch").sum()

            Total  Gross_income
Branch
A       112271.85  19151.300000
B       112825.86  19712.702877
C       118522.07  20325.830000

из таблицы видно, что прибыль и выручка дивизионов примерно одинаковая (нет дивизиона, чья выручка или прибыль в разы превышает остальные)

3.2 сравнение количества продаж и выручки

In [136]:
df[["Product_line", "Total", "Quantity"]].groupby("Product_line").sum()

                            Total  Quantity
Product_line
Clothes and accessories  18188.40       829
Electronic accessories   54337.64       971
Fashion accessories      56769.98      1015
Food and beverages       56144.96       952
Health and beauty        49193.84       854
Home and lifestyle       53861.96       911
Sports and travel        55123.00       920

из таблицы видно, что все категории, кроме "Clothes and accessories" имеют примерно одинаковую выручку и количество продаж. "Clothes and accessories" уступает остальным более чем в 2 раза по выручке при соизмеримом количестве проданного товара. Можно сделать вывод, что каждая единица товара этой категории существенно дешевле, чем стоимость единицы  товара других категорий

3.3 сравнение продаж и маржинальной прибыли от продаж женщинам и мужчинам

In [137]:
df[["Gender", "Total", "Gross_income"]].groupby("Gender").sum()

            Total  Gross_income
Gender
Female  193316.25  33684.842877
Male    150303.53  25504.990000